#ЗАДАНИЕ 1

#1
user1_name = 'Alex'#в начале переменной стоит цыфра,аналогично и с символами они не могут стоять в начале переменной 

#2
user1_age = 20 #не понятно чей это возраст,нужно давать назавание или хотябы номеровать,если ктото зайдет в мой код он не поймет чей это "возраст"
leon_age = 16

#3
print(f'My name,{user1_name}') #во первых нету 'f',а без нее переменная не будет работать,во вторых переменная не в денёшних скобках и я хз зачем '+' т ковычка закрывается в конце перед скобкой 

#4
print(f"My age:{user1_age}") #тоже что и в прошлом нету 'f' нету фигурных скобок и ковычки закрываются в конце перед скобкой 


#ну и чтобы не морочится)))
print(f'My name,{user1_name}\nMy age:{user1_age}')

#5
user2_city = "Kyiv"#тоже чтои во втором задании нужно номеровать или давать названия переменным потомучто если ктото зайдет чекнуть код он не поймет город какого нафиг юзера кто это такой
denis_city = "скотоброд"

#6
balance = 100 #ну во первых символ стоит в начале во вторых подобные символы не могут стоять в назавании переменной,название переменной может быть толькко из букв,цыфр и _



#ЗАДАНИЕ 2

Ukraine_city1= 'Odessa'
user1_city = 'Odessa'

dollar_price = 42.5

player3_haight = 180

user4_name = 'Ivan'




#ЗАДАНИЕ 3

cat_name = 'Барсик'
dog_name = 'Шарик'  #ну по моему так мб я не правильно понял задание 

cat_name = dog_name
dog_name = cat_name



#ЗАДАНИЕ 4

name = input('Как вас зовут?  ')

current_year = int(input('Введите текущий год   '))

birth_year = int(input('Введите свой год рождения  '))

age = current_year - birth_year

print(f'Привет,{name}!\nТебе сейчас (или исполнится) {age} лет.')





#ЗАДАНИЕ 5


total_amount = int(input('Введите общую сумму чека|   '))

quantity = int(input('Введите количество людей,которые были|   '))

sum = total_amount / quantity

print(f'Количество людей:  {quantity}\nОбщая сумма:  {total_amount}\n С каждого человека к оплате:  {sum}')